risks_headers = {
    'risk_id_src': 'Визначення можливих джерел появи ризиків',
    'risk_id_acc': 'Ідентифікація потенційних ризикових подій',
}

risks_sourses = (
    'Визначення можливих джерел появи ризиків', {
        'tech': [
            'Множина джерел появи технічних ризиків',
            'Функціональні характеристики ПЗ',
            'Характеристики якості ПЗ',
            'Характеристики надійсності ПЗ',
            'Застосовність ПЗ',
            'Часова продуктивність ПЗ',
            'Супроводжуваність ПЗ',
            'Повторне використання компонент ПЗ'
        ],
        'cost': [
            'Множина джерел появи вартісних ризиків',
            'Обмеження сумарного бюджету на програмний проект',
            'Недоступна вартість реалізації програмного проекту',
            'Низька ступіть реалізму при оцінюванні витрат на програмний проект'
        ],
        'plan': [
            'Множина джерел появи планових ризиків',
            'Властивості та можливості гнучкості внесення змін до планів життєвого циклу розроблення ПЗ',
            'Можливості порушення встановлених термінів реалізації етапів життєвого циклу розроблення ПЗ',
            'Низька ступінь реалізму при встановленні планів і етапів життєвого циклу розроблення ПЗ'
        ],
        'mang': [
            'Множина джерел появи ризиків реалізації процесів і процедур управління програмним проектом',
            'Хибна стратегія реалізації програмного проекту',
            'Неефективне планування проекту розроблення ПЗ',
            'Неякісне оцінювання програмного проекту',
            'Прогалини в документуванні етапів реалізації програмного проекту',
            'Промахи в прогнозуванні результатів реалізації програмного проекту'
        ]
    }
)

risks_events = (
    'Ідентифікація потенційних ризикових подій', {
        'tech': [
            'Множина настання технічних ризикових подій',
            'Затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ',
            'Небажання команди виконавців ПЗ використовувати інструментальні засоби для підтримки процесу розроблення ПЗ',
            'Відмова команди виконавців від CASE-засобів розроблення ПЗ',
            'Формування запитів на більш потужні інструментальні засоби розроблення ПЗ',
            'Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ',
            'Програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості',
            'Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ',
            'Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ',
            'Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів',
            'Поява дефектних системних компонент, які використовують для розроблення ПЗ'
        ],
        'cost': [
            'Множина настання вартісних ризикових подій',
            'Недооцінювання витрат на реалізацію програмного проекту(надмірно низька вартість)',
            'Переоцінювання витрат на реалізацію програмного проекту(надмірно висока вартість)',
            'Фінансові ускладнення у компанії-замовника ПЗ',
            'Фінансові ускладнення у компанії-розробника ПЗ',
            'Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації',
            'Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації',
            'Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ',
            'Реорганізація структурних підрозділів у компанії-замовника ПЗ',
            'Реорганізація команди виконавців у компанії-розробника ПЗ'
        ],
        'plan': [
            'Множина настання планових ризикових подій',
            'Зміни графіка виконання робіт з боку замовника чи виконавця',
            'Порушення графіка виконання робіт у компанії-розробника ПЗ',
            'Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ',
            'Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ',
            'Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ',
            'Недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ',
            'Переоцінювання тривалості етапів реалізації програмного проекту',
            'Остаточний розмір ПЗ перевищує заплановані його характеристики',
            'Остаточний розмір ПЗ значно менший за планові його характеристики',
            'Поява на ринку аналогічного ПЗ до виходу замовленого',
            'Поява на ринку більш конкурентоздатного ПЗ'
        ],
        'mang': [
            'Множина настання ризикових подій реалізації процесів і процедур управління програмним проектом',
            'Низький моральний стан персоналу команди виконавців ПЗ',
            'Низька взаємодія між членами команди виконавців ПЗ',
            'Пасивність керівника(менеджера) програмного проекту',
            'Недостатня компетентність керівника(менеджера) програмного проекту',
            'Незадоволеність замовника результатами етапів реалізації програмного проекту',
            'Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем',
            'Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ',
            'Одночасна хвороба декількох виконавців підчас розроблення ПЗ',
            'Неможливість організації необхідного навчання персоналу команди виконавців ПЗ',
            'Зміна пріоритетів у процесі управління програмним проектом',
            'Недооцінювання необхідної кількості розробників(підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ',
            'Переоцінювання необхідної кількості розробників(підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ',
            'Надмірне документування результатів на етапах реалізації програмного проекту',
            'Недостатнє документування результатів на етапах реалізації програмного проекту',
            'Нереалістичне прогнозування результатів на етапах реалізації програмного проекту',
            'Недостатній професійний рівень представників від компанії-замовника ПЗ'
        ]
    }
)
